khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
/* Idle clocks sent with CMD high before CMD0. The SD spec wants at least 74
   after power-up; the question is whether the slave insists on them. */
static uint32_t sdio_bb_idle_clocks = 80U;

/* Result of the same probe with the idle clocks suppressed */
volatile uint32_t sdio_bb_noidle = 0U;

/* Enumeration outcome, as a magic value so it is recognisable in a raw memory
   dump even if the symbol table and the running image disagree on layout. */
#define SDIO_MARK_ENUM_OK    0xC0FFEE01U
#define SDIO_MARK_DRIVER_OK  0xC0FFEE02U
#define SDIO_MARK_ENUM_FAIL  0xDEAD0001U
volatile uint32_t sdio_enum_mark = 0U;

/* How far SdioIdentifyCardSlow() got on its last run: 1 entered, 2 CMD0 ok,
   3 inquiry CMD5 ok, 4 slave reported ready, 5 CMD3 ok, 6 CMD7 ok. */
volatile uint32_t sdio_ident_step = 0U;
volatile uint32_t sdio_ident_resp4 = 0U;
volatile uint32_t sdio_enum_retries = 0U;

/* Mirrored out of the log so the result can be read over SWD when the VCP is
   taken: [0] 0=not run 1=answered 2=silent, [1] clocks to the start bit,
   [2]/[3] the R4 bytes. Not static - it has to survive into the map file. */
volatile uint32_t sdio_bb_result[4] = {0U, 0U, 0U, 0U};

/* Answer count per CLKCR phase combination, same reason. Index is
   bit0 = NEGEDGE, bit1 = HWFC_EN. */
volatile uint32_t sdio_phase_result[4] = {0U, 0U, 0U, 0U};

/* Bit-banged CMD5 answered (1) or not (0) at 25/50/100/200/400 kHz. Finds the
   clock the interconnect actually stops carrying, which the CPSM cannot reach:
   its slowest cell is 122 kHz off a 250 MHz kernel clock. */
volatile uint32_t sdio_bb_freq_khz[8] = {0U};
volatile uint32_t sdio_bb_freq_ok[8] = {0U};

static void SdioBbDelay(void)
{
    uint32_t start = DWT->CYCCNT;

    while ((DWT->CYCCNT - start) < sdio_bb_half_cycles) {
    }
}

static uint8_t SdioCrc7(const uint8_t *data, uint32_t len)
{
    uint8_t crc = 0U;
    uint32_t i;
    uint32_t j;

    for (i = 0U; i < len; i++) {
        uint8_t b = data[i];

        for (j = 0U; j < 8U; j++) {
            crc = (uint8_t)(crc << 1);
            if (((b ^ crc) & 0x80U) != 0U) {
                crc ^= 0x09U;
            }
            b = (uint8_t)(b << 1);
        }
    }

    return (uint8_t)(crc & 0x7FU);
}

/* CMD is driven while CK is low, so the slave latches it on the rising edge -
   the "send at negedge, sample at posedge" default the ESP slave documents. */
static void SdioBbClock(uint32_t cmd_bit)
{
    HAL_GPIO_WritePin(GPIOB, GPIO_PIN_2, (cmd_bit != 0U) ? GPIO_PIN_SET : GPIO_PIN_RESET);
    SdioBbDelay();
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12, GPIO_PIN_SET);
    SdioBbDelay();
    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12, GPIO_PIN_RESET);
}

static void SdioBbSendFrame(uint8_t index, uint32_t arg)
{
    uint8_t frame[6];
    uint32_t i;
    uint32_t j;

    frame[0] = (uint8_t)(0x40U | (index & 0x3FU));
    frame[1] = (uint8_t)(arg >> 24);
    frame[2] = (uint8_t)(arg >> 16);
    frame[3] = (uint8_t)(arg >> 8);
    frame[4] = (uint8_t)arg;
    frame[5] = (uint8_t)((SdioCrc7(frame, 5U) << 1) | 1U);

    for (i = 0U; i < 6U; i++) {
        for (j = 0U; j < 8U; j++) {
            SdioBbClock((uint32_t)(frame[i] >> (7U - j)) & 1U);
        }
    }
}

static void SdioBitBangProbe(void)
{
    GPIO_InitTypeDef gpio = {0};
    uint32_t i;
    uint32_t start_clk = 0U;
    uint32_t got_start = 0U;
    uint8_t  resp[6] = {0};

    /* Free-running cycle counter for the sub-millisecond delays */
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0U;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

    if ((DWT->CTRL & DWT_CTRL_CYCCNTENA_Msk) == 0U) {
        SDIO_LOGE(TAG, "bitbang: no cycle counter, skipped");
        return;
    }

    gpio.Mode  = GPIO_MODE_OUTPUT_PP;
    gpio.Pull  = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    gpio.Pin   = GPIO_PIN_12;
    HAL_GPIO_Init(GPIOC, &gpio);
    gpio.Pin   = GPIO_PIN_2;
    HAL_GPIO_Init(GPIOB, &gpio);

    HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12, GPIO_PIN_RESET);

    /* Idle clocks with CMD high, as the card expects before CMD0 */
    for (i = 0U; i < sdio_bb_idle_clocks; i++) {
        SdioBbClock(1U);
    }

    SdioBbSendFrame(0U, 0U);          /* CMD0 - no response expected */
    for (i = 0U; i < 16U; i++) {
        SdioBbClock(1U);
    }

    SdioBbSendFrame(5U, 0U);          /* CMD5 - R4 */

    /* Release CMD to the pull-up so the slave can drive it */
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_NOPULL;
    gpio.Pin  = GPIO_PIN_2;
    HAL_GPIO_Init(GPIOB, &gpio);

    for (i = 0U; i < 200U; i++) {
        SdioBbDelay();
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12, GPIO_PIN_SET);
        SdioBbDelay();
        if (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_2) == GPIO_PIN_RESET) {
            got_start = 1U;
            start_clk = i;
        }
        HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12, GPIO_PIN_RESET);
        if (got_start != 0U) {
            break;
        }
    }

    if (got_start != 0U) {
        /* Start bit already consumed; take the remaining 47 of the R4 frame */
        for (i = 0U; i < 47U; i++) {
            SdioBbDelay();
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12, GPIO_PIN_SET);
            SdioBbDelay();
            if (HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_2) != GPIO_PIN_RESET) {
                resp[(i + 1U) / 8U] |= (uint8_t)(0x80U >> ((i + 1U) % 8U));
            }
            HAL_GPIO_WritePin(GPIOC, GPIO_PIN_12, GPIO_PIN_RESET);
        }

        sdio_bb_result[0] = 1U;
        sdio_bb_result[1] = start_clk;
        sdio_bb_result[2] = ((uint32_t)resp[0] << 24) | ((uint32_t)resp[1] << 16) |
                            ((uint32_t)resp[2] << 8) | (uint32_t)resp[3];
        sdio_bb_result[3] = ((uint32_t)resp[4] << 8) | (uint32_t)resp[5];

        SDIO_LOGE(TAG, "bitbang: slave answered CMD5 after %lu clocks - "
                       "%02x %02x %02x %02x %02x %02x",
                  (unsigned long)start_clk, resp[0], resp[1], resp[2],
                  resp[3], resp[4], resp[5]);
        SDIO_LOGE(TAG, "  the slave decodes a hand-built frame, so the fault is "
                       "in the SDMMC setup, not the link");
    } else {
        sdio_bb_result[0] = 2U;
        SDIO_LOGE(TAG, "bitbang: no start bit in 200 clocks after CMD5");
        SDIO_LOGE(TAG, "  the slave ignores a frame built by hand at 25 kHz with "
                       "a 200-clock window, so it is not decoding CMD at all - "
                       "stop tuning the host");
    }

