khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
    SdioSetPadSpeed(SDIO_PORT_GPIO_SPEED);
}

/**
  * @brief Frame-alignment verdict on one R4.
  *
  * The host's shift register always clocks exactly 32 times, so it cannot lose
  * bits: a response that arrives short means the slave advanced its output
  * early, i.e. it saw CK edges the host never issued. RESPCMD says whether the
  * drift had already started by the index field (0x3F = still aligned there),
  * and the trailing reserved ones shifted into the bottom of RESP1 say how many
  * clocks were lost by the end.
  *
  * The NF field is not usable as a verdict - it is one of the first bits to be
  * pushed out, which is why a glitching bus reads as "0 IO functions".
  */
static void SdioReportAlignment(uint32_t resp4, uint32_t respcmd)
{
    uint32_t k;

    if ((respcmd == SDIO_R4_RESPCMD) && ((resp4 & SDIO_R4_OCR_RSVD_MSK) == 0U)) {
        SDIO_LOGE(TAG, "    frame aligned, nf=%lu, OCR=0x%06lx",
                  (unsigned long)((resp4 & 0x70000000U) >> 28U),
                  (unsigned long)(resp4 & 0x00FFFFFFU));
        return;
    }

    for (k = 1U; k < 8U; k++) {
        if (((resp4 & ((1UL << k) - 1UL)) == ((1UL << k) - 1UL)) &&
            (((resp4 >> k) & SDIO_R4_OCR_RSVD_MSK) == 0U)) {
            SDIO_LOGE(TAG, "    slave saw %lu extra CK edge(s) during the "
                           "response (resp = R4<<%lu); OCR=0x%06lx recovered, "
                           "NF lost off the top, index field %s",
                      (unsigned long)k, (unsigned long)k,
                      (unsigned long)((resp4 >> k) & 0x00FFFFFFU),
                      (respcmd == SDIO_R4_RESPCMD) ? "still intact (drift began "
                                                     "in the payload)"
                                                   : "already short (drift began "
                                                     "before the payload)");
            return;
        }
    }
    SDIO_LOGE(TAG, "    corrupt - no single clock count fits the frame");
}

static uint32_t sdio_probe_answered;

/**
  * @brief One matrix cell: SDIO_PROBE_REPEAT x CMD5 at a fixed slew and CLKDIV.
  */
static void SdioProbeCmd5(uint32_t clkdiv, uint32_t arg, const char *speed_name)
{
    uint32_t i;
    uint32_t resp4 = 0U;
    uint32_t first = 0U;
    uint32_t last = 0U;
    uint32_t respcmd = 0U;
    uint32_t answered = 0U;
    uint32_t varies = 0U;

    MODIFY_REG(hsdio1.Instance->CLKCR, SDMMC_CLKCR_CLKDIV, clkdiv);
    HAL_Delay(2U);
    (void)SDMMC_CmdGoIdleState(hsdio1.Instance);
    HAL_Delay(2U);

    for (i = 0U; i < SDIO_PROBE_REPEAT; i++) {
        resp4 = 0U;
        if (SDMMC_CmdSendOperationcondition(hsdio1.Instance, arg, &resp4) == 0U) {
            if (answered == 0U) {
                first = resp4;
                respcmd = hsdio1.Instance->RESPCMD & 0x3FU;
            } else if (resp4 != first) {
                varies = 1U;
            }
            last = resp4;
            answered++;
        }
        HAL_Delay(1U);
    }

    sdio_probe_answered = answered;

    SDIO_LOGE(TAG, "  pads=%-5s div=%-4lu arg=0x%08lx answered=%lu/%u "
                   "respcmd=0x%02lx resp=0x%08lx",
              speed_name, (unsigned long)clkdiv, (unsigned long)arg,
              (unsigned long)answered, (unsigned int)SDIO_PROBE_REPEAT,
              (unsigned long)respcmd, (unsigned long)first);

    /* With a voltage window in the argument the card leaves busy part way
       through the batch and legitimately answers differently, so a changing
       response is only a fault indication when the argument is 0. */
    if (varies != 0U) {
        SDIO_LOGE(TAG, "    last=0x%08lx - response changed during the batch%s",
                  (unsigned long)last,
                  (arg != 0U) ? " (expected: card leaving busy)"
                              : " (with arg=0 this is a fault - unstable link)");
    }

    if (answered != 0U) {
        SdioReportAlignment(first, respcmd);
    }
}

/**
  * @brief Sweep pad slew rate x bus clock, repeating CMD5 in every cell.
  *
  * Three outcomes are worth separating and none of them is visible from a
  * single CMD5: nothing ever answers (slave silent, or a dead net), some tries
  * answer (intermittent connection - a resistive joint, not a missing one), or
  * every try answers with a shifted frame (bus timing).
  */
#if (SDIO_PORT_ESP_RST_BOOT_MS != 0)
/**
  * @brief Pulse the ESP32-C6 EN pin, then wait for esp-at to come up.
  *
  * Puts the slave in a known state at every host start, which is what makes
  * enumeration repeatable: the software CCCR reset only reaches a slave still
  * willing to decode CMD52, this reaches one that is not.
  */
static void SdioResetSlaveHw(void)
{
    GPIO_InitTypeDef gpio = {0};

    __HAL_RCC_GPIOB_CLK_ENABLE();

    gpio.Pin   = SDIO_PORT_ESP_RST_PIN;
    gpio.Mode  = GPIO_MODE_OUTPUT_OD;
    gpio.Pull  = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(SDIO_PORT_ESP_RST_PORT, &gpio);

    HAL_GPIO_WritePin(SDIO_PORT_ESP_RST_PORT, SDIO_PORT_ESP_RST_PIN, GPIO_PIN_RESET);
    HAL_Delay(SDIO_PORT_ESP_RST_LOW_MS);
    /* Open-drain high is a release, not a drive - the devkit pull-up takes it */
    HAL_GPIO_WritePin(SDIO_PORT_ESP_RST_PORT, SDIO_PORT_ESP_RST_PIN, GPIO_PIN_SET);

    SDIO_LOGI(TAG, "slave held in reset %u ms, waiting %u ms for esp-at",
              (unsigned int)SDIO_PORT_ESP_RST_LOW_MS,
              (unsigned int)SDIO_PORT_ESP_RST_BOOT_MS);
    HAL_Delay(SDIO_PORT_ESP_RST_BOOT_MS);
}
#endif /* SDIO_PORT_ESP_RST_BOOT_MS */

/**
  * @brief CMD52 write of the CCCR RES bit - the only reset an I/O card honours.
  *
  * CMD0 is a memory-card command and an I/O-only slave is free to ignore it, so
  * a host that restarts while the slave keeps running meets a card still holding
  * the RCA and enabled function from the previous session, quietly ignoring
  * CMD5. No amount of retrying breaks that loop; a write of RES to CCCR 0x06
  * does, and it is harmless on a slave that is already idle.
  *
  * The response is deliberately not checked: a wedged slave will not send one,
  * and it acts on the write either way.
  */
static void SdioResetSlaveIo(void)
{
    SDMMC_CmdInitTypeDef cmd = {0};
    uint32_t tickstart;

