khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
    if (SDMMC_GetPowerState(hsdio1.Instance) == 0U) {
        return;
    }

    /* R/W=1, function 0, RAW=0, address 0x06 (I/O Abort), data 0x08 (RES) */
    cmd.Argument         = 0x80000C08U;
    cmd.CmdIndex         = SDMMC_CMD_SDMMC_RW_DIRECT;
    cmd.Response         = SDMMC_RESPONSE_SHORT;
    cmd.WaitForInterrupt = SDMMC_WAIT_NO;
    cmd.CPSM             = SDMMC_CPSM_ENABLE;
    (void)SDMMC_SendCommand(hsdio1.Instance, &cmd);

    tickstart = HAL_GetTick();
    while (((hsdio1.Instance->STA & (SDMMC_FLAG_CMDREND | SDMMC_FLAG_CTIMEOUT |
                                     SDMMC_FLAG_CCRCFAIL)) == 0U) &&
           ((HAL_GetTick() - tickstart) < 10U)) {
    }
    __SDMMC_CLEAR_FLAG(hsdio1.Instance, SDMMC_STATIC_CMD_FLAGS);

    /* The slave needs a moment to fall back to the pre-init state */
    HAL_Delay(20U);
}

/**
  * @brief Does the CPSM actually put a frame on CMD, and does CK really run?
  *
  * Everything else in the probe only says "no response", which cannot tell a
  * silent slave from a host that never transmitted. The AF does not disable the
  * input path, so IDR still shows what the pad is doing: kick a CMD0 off
  * without waiting for it, then sample both pads flat out for longer than the
  * 48-bit frame lasts. CK is the control - it free-runs, so a run of all-high
  * there means the sampling itself is broken.
  */
static void SdioProbeLineActivity(void)
{
    SDMMC_CmdInitTypeDef cmd = {0};
    uint32_t i;
    uint32_t cmd_low = 0U;
    uint32_t ck_low = 0U;
    uint32_t d3_low = 0U;

    cmd.Argument         = 0U;
    cmd.CmdIndex         = SDMMC_CMD_GO_IDLE_STATE;
    cmd.Response         = SDMMC_RESPONSE_NO;
    cmd.WaitForInterrupt = SDMMC_WAIT_NO;
    cmd.CPSM             = SDMMC_CPSM_ENABLE;
    (void)SDMMC_SendCommand(hsdio1.Instance, &cmd);

    /* ~20k reads of two IDRs outlasts a 48-bit frame at 400 kHz by a wide margin */
    for (i = 0U; i < 20000U; i++) {
        if ((GPIOB->IDR & GPIO_PIN_2) == 0U) {
            cmd_low++;
        }
        if ((GPIOC->IDR & GPIO_PIN_12) == 0U) {
            ck_low++;
        }
        /* DAT3 is CS at CMD0 time: low selects SPI mode, and an SDIO slave in
           SPI mode ignores CMD5 forever. It must stay high through the frame. */
        if ((GPIOC->IDR & GPIO_PIN_11) == 0U) {
            d3_low++;
        }
    }

    __SDMMC_CLEAR_FLAG(hsdio1.Instance, SDMMC_STATIC_CMD_FLAGS);

    SDIO_LOGE(TAG, "probe: line activity during CMD0 - CMD low %lu/%u, "
                   "CK low %lu/%u, D3 low %lu/%u", (unsigned long)cmd_low, 20000U,
              (unsigned long)ck_low, 20000U, (unsigned long)d3_low, 20000U);

    if (d3_low != 0U) {
        SDIO_LOGE(TAG, "  D3/CS went low during CMD0 - that latches the slave "
                       "into SPI mode, where CMD5 is never answered. D3 must "
                       "stay high until enumeration is done");
    }

    if (ck_low == 0U) {
        SDIO_LOGE(TAG, "  CK never sampled low - the clock is not running, so "
                       "nothing below this line means anything");
    } else if (cmd_low == 0U) {
        SDIO_LOGE(TAG, "  CMD never left the pull-up while CK ran - the CPSM is "
                       "not driving PB2, so the slave has nothing to answer");
    } else {
        SDIO_LOGE(TAG, "  host transmits: CK toggles and CMD is pulled low "
                       "inside the frame, so the timeout is at the slave");
    }
}

/**
  * @brief CMD5 at each CLKCR sampling phase, with everything else held still.
  *
  * The slave answers a bit-banged CMD5 with NCR=2, the spec minimum, so the CPSM
  * has no slack: half a cycle of error in where it turns CMD around or samples
  * the reply and it misses the start bit and reports a plain timeout. NEGEDGE
  * moves exactly that phase, and HWFC_EN is swept with it because it also gates
  * when the CPSM releases the line.
  */
static void SdioProbeClkPhase(uint32_t base_div)
{
    static const char *const phase_name[4] = {
        "posedge no-hwfc", "negedge no-hwfc", "posedge hwfc", "negedge hwfc"
    };
    uint32_t i;

    SDIO_LOGE(TAG, "probe: CLKCR sampling phase");

    for (i = 0U; i < 4U; i++) {
        uint32_t clkcr = hsdio1.Instance->CLKCR;

        clkcr &= ~(SDMMC_CLKCR_NEGEDGE | SDMMC_CLKCR_HWFC_EN);
        if ((i & 1U) != 0U) {
            clkcr |= SDMMC_CLKCR_NEGEDGE;
        }
        if ((i & 2U) != 0U) {
            clkcr |= SDMMC_CLKCR_HWFC_EN;
        }
        hsdio1.Instance->CLKCR = clkcr;
        HAL_Delay(2U);

        SdioProbeCmd5(base_div, 0U, phase_name[i]);
        sdio_phase_result[i] = sdio_probe_answered;
    }

    /* Back to the configured phase so nothing downstream inherits the sweep */
    MODIFY_REG(hsdio1.Instance->CLKCR,
               SDMMC_CLKCR_NEGEDGE | SDMMC_CLKCR_HWFC_EN,
               hsdio1.Init.ClockEdge | hsdio1.Init.HardwareFlowControl);
}

static void SdioProbeSlave(void)
{
    GPIO_InitTypeDef gpio = {0};
    uint32_t err;
    uint32_t speed;
    uint32_t base_div = hsdio1.Instance->CLKCR & SDMMC_CLKCR_CLKDIV;
    GPIO_PinState cmd_level;

    if (SDMMC_GetPowerState(hsdio1.Instance) == 0U) {
        SDIO_LOGE(TAG, "probe: SDMMC1 power state is off");
        return;
    }

    err = SDMMC_CmdGoIdleState(hsdio1.Instance);
    SDIO_LOGE(TAG, "probe: CMD0 err=0x%08lx", (unsigned long)err);
    SdioProbeLineActivity();
    SDIO_LOGE(TAG, "probe: CMD5 matrix, slew rate x clock (div 0x3ff = slowest)");

    for (speed = 0U; speed < SDIO_PROBE_SPEED_COUNT; speed++) {
        SdioSetPadSpeed(sdio_probe_speed[speed]);
        SdioProbeCmd5(base_div, 0U, sdio_probe_speed_name[speed]);
        SdioProbeCmd5(0x3FFU, 0U, sdio_probe_speed_name[speed]);
    }

    SdioSetPadSpeed(SDIO_PORT_GPIO_SPEED);
    SdioProbeCmd5(base_div, SDIO_OCR_3V3_WINDOW, "cfg");
    MODIFY_REG(hsdio1.Instance->CLKCR, SDMMC_CLKCR_CLKDIV, base_div);

    gpio.Pin = GPIO_PIN_2;
    gpio.Mode = GPIO_MODE_INPUT;
    gpio.Pull = GPIO_NOPULL;
    HAL_GPIO_Init(GPIOB, &gpio);
    cmd_level = HAL_GPIO_ReadPin(GPIOB, GPIO_PIN_2);
    SDIO_LOGE(TAG, "probe: CMD pin level after timeout: %s",
              (cmd_level == GPIO_PIN_SET) ? "high" : "low");

    gpio.Mode = GPIO_MODE_AF_PP;
    gpio.Speed = SDIO_PORT_GPIO_SPEED;
    gpio.Alternate = GPIO_AF12_SDMMC1;
    HAL_GPIO_Init(GPIOB, &gpio);

