khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
    SdioProbeClkPhase(base_div);

    /* Does the slave insist on the 74 idle clocks the spec asks for after
       power-up? The HAL sends CMD0 straight after powering the CPSM on, so if
       it does, the CPSM can never enumerate no matter how it is tuned. */
    sdio_bb_idle_clocks = 0U;
    sdio_bb_result[0] = 0U;
    SdioBitBangProbe();
    sdio_bb_noidle = sdio_bb_result[0];
    sdio_bb_idle_clocks = 80U;
    sdio_bb_result[0] = 0U;
    SdioBitBangProbe();
    SDIO_LOGE(TAG, "  bitbang idle-clock A/B: without=%s with=%s",
              (sdio_bb_noidle == 1U) ? "answered" : "silent",
              (sdio_bb_result[0] == 1U) ? "answered" : "silent");

    /* Where does the interconnect actually stop carrying a frame? */
    {
        static const uint32_t half[5] = { 5000U, 2500U, 1250U, 625U, 312U };
        static const uint32_t khz[5]  = { 25U, 50U, 100U, 200U, 400U };
        uint32_t f;

        for (f = 0U; f < 5U; f++) {
            sdio_bb_half_cycles = half[f];
            sdio_bb_result[0] = 0U;
            SdioBitBangProbe();
            sdio_bb_freq_khz[f] = khz[f];
            sdio_bb_freq_ok[f] = (sdio_bb_result[0] == 1U) ? 1U : 0U;
            SDIO_LOGE(TAG, "  bitbang %lu kHz: %s", (unsigned long)khz[f],
                      (sdio_bb_result[0] == 1U) ? "answered" : "silent");
        }
        sdio_bb_half_cycles = 5000U;
    }

    SDIO_LOGE(TAG, "probe: 'answered=0/8' everywhere is a silent slave or a dead "
                   "net; a mix of 0/8 and 8/8 is an intermittent joint; 8/8 with "
                   "a constant edge count on every row is CMD-to-CK coupling, "
                   "which no host setting can fix - separate CK from CMD, and "
                   "filter CK at the slave input");
}

#if (SDIO_PORT_PIN_DIAG != 0)
typedef struct {
    const char   *name;
    GPIO_TypeDef *port;
    uint16_t      pin;
    uint8_t       has_pullup;   /* the board fits a 10k pull-up on this net */
} SdioPinDesc;

static const SdioPinDesc sdio_pins[] = {
    { "CMD(PB2)",  GPIOB, GPIO_PIN_2,  1U },
    { "D0(PB13)",  GPIOB, GPIO_PIN_13, 1U },
    { "D1(PC9)",   GPIOC, GPIO_PIN_9,  1U },
    { "D2(PC10)",  GPIOC, GPIO_PIN_10, 1U },
    { "D3(PC11)",  GPIOC, GPIO_PIN_11, 1U },
    { "CK(PC12)",  GPIOC, GPIO_PIN_12, 0U },
};
#define SDIO_PIN_COUNT (sizeof(sdio_pins) / sizeof(sdio_pins[0]))

/* Control: LD1, nothing external on the net. If this one also fails to read
   back what the output driver puts on it, the diagnostic itself is wrong. */
static const SdioPinDesc sdio_ctrl_pin = { "CTRL(PA5)", GPIOA, GPIO_PIN_5, 0U };

static void SdioPinMode(const SdioPinDesc *p, uint32_t mode, uint32_t pull)
{
    GPIO_InitTypeDef gpio = {0};

    gpio.Pin = p->pin;
    gpio.Mode = mode;
    gpio.Pull = pull;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;
    HAL_GPIO_Init(p->port, &gpio);
}

static GPIO_PinState SdioPinRead(const SdioPinDesc *p, uint32_t pull)
{
    SdioPinMode(p, GPIO_MODE_INPUT, pull);
    HAL_Delay(2U);
    return HAL_GPIO_ReadPin(p->port, p->pin);
}

/**
  * @brief Electrical check of the six SDMMC nets, before any AF is muxed on.
  *
  * Two passes, neither of which needs a scope:
  *
  * 1. Pull-up census. Read each pin with the internal pull-down engaged (~40k);
  *    an external 10k to 3V3 wins, so high means "the pull-up, and therefore the
  *    wire it sits on, is really there". Low means the net is floating - a
  *    missing pull-up or an open jumper - which is exactly what makes CMD5 time
  *    out. CK carries no pull-up, so it is only driven, not censused.
  * 2. Short matrix. Drive one pin low while the other five are inputs with
  *    internal pull-ups; anything that follows shares copper with it. Catches
  *    shorted or swapped jumpers, and a pin that cannot be pulled low by its own
  *    output driver is shorted to 3V3.
  */
static uint32_t SdioPinDiag(void)
{
    uint32_t i;
    uint32_t j;
    uint32_t floating = 0U;
    uint32_t stuck = 0U;

    __HAL_RCC_GPIOA_CLK_ENABLE();
    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();

    /* Validate the method itself on a net with nothing attached */
    SdioPinMode(&sdio_ctrl_pin, GPIO_MODE_OUTPUT_PP, GPIO_NOPULL);
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_RESET);
    HAL_Delay(2U);
    i = (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_5) == GPIO_PIN_RESET) ? 1U : 0U;
    HAL_GPIO_WritePin(GPIOA, GPIO_PIN_5, GPIO_PIN_SET);
    HAL_Delay(2U);
    j = (HAL_GPIO_ReadPin(GPIOA, GPIO_PIN_5) == GPIO_PIN_SET) ? 1U : 0U;
    SDIO_LOGE(TAG, "pin diag: control %s drive0=%s drive1=%s%s", sdio_ctrl_pin.name,
              (i != 0U) ? "ok" : "FAIL", (j != 0U) ? "ok" : "FAIL",
              ((i & j) != 0U) ? "" : " - readback method is broken, ignore the rest");
    SdioPinMode(&sdio_ctrl_pin, GPIO_MODE_INPUT, GPIO_NOPULL);

    SDIO_LOGE(TAG, "pin diag: pull-up census (expect 'high' on CMD and D0-D3)");
    for (i = 0U; i < SDIO_PIN_COUNT; i++) {
        GPIO_PinState with_pd;
        GPIO_PinState with_pu;

        if (sdio_pins[i].has_pullup == 0U) {
            continue;
        }

        with_pd = SdioPinRead(&sdio_pins[i], GPIO_PULLDOWN);
        with_pu = SdioPinRead(&sdio_pins[i], GPIO_PULLUP);

        if (with_pd == GPIO_PIN_SET) {
            /* A hard short to 3V3 reads the same here; the matrix separates them */
            SDIO_LOGE(TAG, "  %s: high  (something pulls this net up)",
                      sdio_pins[i].name);
        } else if (with_pu == GPIO_PIN_SET) {
            floating++;
            SDIO_LOGE(TAG, "  %s: FLOAT (no external pull-up - open wire or "
                           "missing resistor)", sdio_pins[i].name);
        } else {
            SDIO_LOGE(TAG, "  %s: LOW   (net shorted to GND)", sdio_pins[i].name);
        }
    }

    SDIO_LOGE(TAG, "pin diag: short matrix");
    for (i = 0U; i < SDIO_PIN_COUNT; i++) {
        for (j = 0U; j < SDIO_PIN_COUNT; j++) {
            if (j != i) {
                SdioPinMode(&sdio_pins[j], GPIO_MODE_INPUT, GPIO_PULLUP);
            }
        }

        SdioPinMode(&sdio_pins[i], GPIO_MODE_OUTPUT_PP, GPIO_NOPULL);
        HAL_GPIO_WritePin(sdio_pins[i].port, sdio_pins[i].pin, GPIO_PIN_RESET);
        HAL_Delay(2U);

        if (HAL_GPIO_ReadPin(sdio_pins[i].port, sdio_pins[i].pin) != GPIO_PIN_RESET) {
            uint32_t pos = (uint32_t)(31 - __CLZ((uint32_t)sdio_pins[i].pin));

            stuck++;
            /* Separate "the pad is really being driven and loses" from "the
               config write never landed" (GTZC/SECCFGR, missing clock, LCKR) */
            SDIO_LOGE(TAG, "  %s: driven low but reads high - MODER=%lu ODR=%lu "
                           "OTYPER=%lu PUPDR=%lu",
                      sdio_pins[i].name,
                      (unsigned long)((sdio_pins[i].port->MODER >> (2U * pos)) & 3U),
                      (unsigned long)((sdio_pins[i].port->ODR >> pos) & 1U),
                      (unsigned long)((sdio_pins[i].port->OTYPER >> pos) & 1U),
                      (unsigned long)((sdio_pins[i].port->PUPDR >> (2U * pos)) & 3U));
        }

