khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
        for (j = 0U; j < SDIO_PIN_COUNT; j++) {
            if ((j != i) &&
                (HAL_GPIO_ReadPin(sdio_pins[j].port, sdio_pins[j].pin) == GPIO_PIN_RESET)) {
                SDIO_LOGE(TAG, "  %s shorted to %s", sdio_pins[i].name, sdio_pins[j].name);
            }
        }

        HAL_GPIO_WritePin(sdio_pins[i].port, sdio_pins[i].pin, GPIO_PIN_SET);
        HAL_Delay(2U);
    }

    /* Leave everything as a plain input; HAL_SDIO_MspInit() muxes the AF back on */
    for (i = 0U; i < SDIO_PIN_COUNT; i++) {
        SdioPinMode(&sdio_pins[i], GPIO_MODE_INPUT, GPIO_NOPULL);
    }

    if (stuck != 0U) {
        /* MODER=1/ODR=0/OTYPER=0 in the lines above means the pad really is a
           push-pull output driving low, so only a low impedance path to 3V3 can
           hold the net high - a bridged or mis-wired pull-up, not a 10k one.
           The host cannot assert CMD in this state, which is the CMD5 timeout. */
        SDIO_LOGE(TAG, "pin diag: %lu net(s) tied hard to 3V3 - the host cannot "
                       "drive them at all; rework the pull-ups before blaming "
                       "the slave", (unsigned long)stuck);
    } else if (floating != 0U) {
        SDIO_LOGE(TAG, "pin diag: %lu net(s) floating - fix the wiring before "
                       "reading anything into the CMD5 timeout",
                  (unsigned long)floating);
    } else {
        SDIO_LOGE(TAG, "pin diag: wiring looks sane from the host side");
    }

    return stuck + floating;
}
#endif /* SDIO_PORT_PIN_DIAG */

#if (SDIO_PORT_CK_TOGGLE_MS != 0)
/**
  * @brief Square wave on CK and CMD, slow enough for a meter or logic probe.
  *
  * Proves the host really drives PC12/PB2 and that the far end sees them,
  * which the SDMMC at 400 kHz cannot demonstrate without an analyser.
  */
static void SdioToggleCk(void)
{
    /* One net at a time, so whoever is watching the slave can tell which host
       pin a given ESP32-C6 pad is actually wired to. Expected far end:
       CK->GPIO19, CMD->GPIO18, D0->GPIO20, D1->GPIO21, D2->GPIO22, D3->GPIO23 */
    static const struct {
        const char   *name;
        const char   *far_end;
        GPIO_TypeDef *port;
        uint16_t      pin;
    } sweep[] = {
        { "CK(PC12)",  "GPIO19", GPIOC, GPIO_PIN_12 },
        { "CMD(PB2)",  "GPIO18", GPIOB, GPIO_PIN_2  },
        { "D0(PB13)",  "GPIO20", GPIOB, GPIO_PIN_13 },
        { "D1(PC9)",   "GPIO21", GPIOC, GPIO_PIN_9  },
        { "D2(PC10)",  "GPIO22", GPIOC, GPIO_PIN_10 },
        { "D3(PC11)",  "GPIO23", GPIOC, GPIO_PIN_11 },
    };
    GPIO_InitTypeDef gpio = {0};
    uint32_t i;
    uint32_t end;

    __HAL_RCC_GPIOB_CLK_ENABLE();
    __HAL_RCC_GPIOC_CLK_ENABLE();

    gpio.Mode = GPIO_MODE_OUTPUT_PP;
    gpio.Pull = GPIO_NOPULL;
    gpio.Speed = GPIO_SPEED_FREQ_LOW;

    for (i = 0U; i < (sizeof(sweep) / sizeof(sweep[0])); i++) {
        gpio.Pin = sweep[i].pin;
        HAL_GPIO_Init(sweep[i].port, &gpio);
        HAL_GPIO_WritePin(sweep[i].port, sweep[i].pin, GPIO_PIN_SET);

        SDIO_LOGE(TAG, "sweep: %s alone at 2 Hz for %u ms - expect it at "
                       "ESP32-C6 %s", sweep[i].name,
                  (unsigned int)SDIO_PORT_CK_TOGGLE_MS, sweep[i].far_end);

        end = HAL_GetTick() + SDIO_PORT_CK_TOGGLE_MS;
        while (HAL_GetTick() < end) {
            HAL_GPIO_TogglePin(sweep[i].port, sweep[i].pin);
            HAL_Delay(250U);
        }

        /* Release the net (pull-ups take it high) and leave a quiet gap so the
           next window is unambiguous */
        HAL_GPIO_WritePin(sweep[i].port, sweep[i].pin, GPIO_PIN_SET);
        gpio.Mode = GPIO_MODE_INPUT;
        HAL_GPIO_Init(sweep[i].port, &gpio);
        gpio.Mode = GPIO_MODE_OUTPUT_PP;
        HAL_Delay(1500U);
    }
}
#endif /* SDIO_PORT_CK_TOGGLE_MS */

#if (SDIO_PORT_BUS_WIDTH == HAL_SDIO_4_WIRES_MODE)
/**
  * @brief Widen the link to 4 bits once enumeration has completed.
  *
  * HAL_SDIO_Init() compares hsdio->Init.BusWide (an SDMMC_BUS_WIDE_* register
  * value) against HAL_SDIO_4_WIRES_MODE (1), so it always writes 1-bit into
  * CCCR 0x07. Enumeration therefore runs in 1-bit and the switch is done here:
  * CMD52 travels on CMD only, so it is unaffected by the width, and CLKCR is
  * moved to 4-bit only after the slave has acknowledged the new setting.
  */
static sdio_err_t SdioSetBusWidth4(void)
{
    uint8_t val;

    if (sdio_driver_read_byte(0U, SDIO_CCCR_BUS_IF_CTRL, &val) != SDIO_SUCCESS) {
        SDIO_LOGE(TAG, "CCCR 0x07 read failed");
        return FAILURE;
    }

    val = (uint8_t)((val & ~SDIO_CCCR_BUS_WIDTH_MSK) | SDIO_CCCR_BUS_WIDTH_4B);
    if (sdio_driver_write_byte(0U, SDIO_CCCR_BUS_IF_CTRL, val, &val) != SDIO_SUCCESS) {
        SDIO_LOGE(TAG, "CCCR 0x07 write failed");
        return FAILURE;
    }

    if ((val & SDIO_CCCR_BUS_WIDTH_MSK) != SDIO_CCCR_BUS_WIDTH_4B) {
        SDIO_LOGE(TAG, "slave refused 4-bit, CCCR 0x07 = 0x%02x", (unsigned int)val);
        return FAILURE;
    }

    MODIFY_REG(hsdio1.Instance->CLKCR, SDMMC_CLKCR_WIDBUS, SDMMC_BUS_WIDE_4B);
    hsdio1.Init.BusWide = SDMMC_BUS_WIDE_4B;

    SDIO_LOGI(TAG, "bus width switched to 4-bit");
    return SDIO_SUCCESS;
}
#endif /* SDIO_PORT_BUS_WIDTH == HAL_SDIO_4_WIRES_MODE */

/* CMD5 argument: 3.2-3.3V window, no 1.8V switch request */
#define SDIO_IDENT_OCR_VDD_32_33  (1UL << 20U)

/* Per-command retries inside identification. The link drops frames at a low
   rate; retrying the command is far cheaper than restarting enumeration. */
#define SDIO_IDENT_CMD_RETRY      32U

/**
  * @brief Replacement for the HAL identification step, run at the port's clock.
  *
  * HAL_SDIO_Init() recomputes Init.ClockDiv from its private SDIO_INIT_FREQ
  * (400 kHz) and enumerates there, throwing away hsdio1.Init.ClockDiv - it only
  * restores it after identification succeeds. This link does not carry a frame
  * at 400 kHz: the bit-banged probe reads a valid R4 at 25 kHz and nothing at
  * 400 kHz, which is why every clock, slew and phase sweep changed nothing. They
  * were all outside the window the HAL re-initialises.
  *
  * SDIO_IdentifyCard is a documented hook and the HAL only defaults it when it
  * is NULL, so this runs the same CMD0/CMD5/CMD3/CMD7 sequence with the clock
  * put back to SDIO_PORT_CLOCK_HZ first, plus the 74 idle cycles the slave turns
  * out to insist on - a bit-banged CMD5 with them is answered, without them it
  * is not.
  */
static HAL_StatusTypeDef SdioIdentifyCardSlow(SDIO_HandleTypeDef *hsdio)
{
    uint32_t errorstate;
    uint32_t resp4 = 0U;
    uint32_t timeout;
    uint16_t rca = 1U;

    sdio_ident_step = 1U;

    /* Undo the HAL's 400 kHz and give the slave its power-up clocks at ours */
    MODIFY_REG(hsdio->Instance->CLKCR, SDMMC_CLKCR_CLKDIV, hsdio->Init.ClockDiv);
    HAL_Delay(1U + (74U * 1000U / SDIO_PORT_CLOCK_HZ) + 1U);

