khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
    for (timeout = 0U; timeout < SDIO_IDENT_CMD_RETRY; timeout++) {
        if (SDMMC_CmdGoIdleState(hsdio->Instance) == HAL_SDIO_ERROR_NONE) {
            break;
        }
        HAL_Delay(2U);
    }

    if (timeout >= SDIO_IDENT_CMD_RETRY) {
        return HAL_ERROR;
    }

    sdio_ident_step = 2U;

    if (SDMMC_GetPowerState(hsdio->Instance) == 0U) {
        return HAL_ERROR;
    }

    /* Inquiry CMD5 - arg 0 never sets C, it only reports the OCR.

       Retried here rather than upwards: a single timed-out command used to fail
       the whole HAL_SDIO_Init(), which tears the card back down to RESET and
       re-runs CMD0 from scratch. On a link that drops the occasional frame that
       turns a recoverable hiccup into a total failure, and the step markers show
       exactly that - runs that failed at this command had already seen a ready
       R4 from an earlier attempt in the same batch. */
    for (timeout = 0U; timeout < SDIO_IDENT_CMD_RETRY; timeout++) {
        if (SDMMC_CmdSendOperationcondition(hsdio->Instance, 0U, &resp4) ==
            HAL_SDIO_ERROR_NONE) {
            break;
        }
        HAL_Delay(2U);
        (void)SDMMC_CmdGoIdleState(hsdio->Instance);
        HAL_Delay(2U);
    }

    if (timeout >= SDIO_IDENT_CMD_RETRY) {
        return HAL_ERROR;
    }

    sdio_ident_step = 3U;
    sdio_ident_resp4 = resp4;

    if (((resp4 & 0x70000000U) >> 28U) == 0U) {
        return HAL_ERROR;      /* no I/O function - not an SDIO card */
    }

    /* Now poll with the voltage window until the slave reports ready. The HAL
       asks once and gives up, which loses the race whenever the slave is still
       initialising. */
    for (timeout = 0U; timeout < 1000U; timeout++) {
        if (SDMMC_CmdSendOperationcondition(hsdio->Instance,
                                            SDIO_IDENT_OCR_VDD_32_33,
                                            &resp4) == HAL_SDIO_ERROR_NONE) {
            if ((resp4 & 0x80000000U) != 0U) {
                break;
            }
        }
        HAL_Delay(1U);
    }

    if ((resp4 & 0x80000000U) == 0U) {
        return HAL_ERROR;
    }

    sdio_ident_step = 4U;
    sdio_ident_resp4 = resp4;

    /* CMD0 before CMD3 makes CMD3 illegal for a while; the HAL retries and so
       does this. */
    timeout = 0U;
    do {
        errorstate = SDMMC_CmdSetRelAdd(hsdio->Instance, &rca);
        timeout++;
        HAL_Delay(1U);
    } while ((errorstate != HAL_SDIO_ERROR_NONE) && (timeout < 1000U));

    if (errorstate != HAL_SDIO_ERROR_NONE) {
        return HAL_ERROR;
    }

    sdio_ident_step = 5U;

    for (timeout = 0U; timeout < SDIO_IDENT_CMD_RETRY; timeout++) {
        if (SDMMC_CmdSelDesel(hsdio->Instance, ((uint32_t)rca) << 16U) ==
            HAL_SDIO_ERROR_NONE) {
            break;
        }
        HAL_Delay(2U);
    }

    if (timeout >= SDIO_IDENT_CMD_RETRY) {
        return HAL_ERROR;
    }

    sdio_ident_step = 6U;
    return HAL_OK;
}

sdio_err_t sdio_driver_init(void)
{
    uint32_t kernel_clk;
    uint32_t retry;
    HAL_StatusTypeDef status = HAL_ERROR;

#if (SDIO_PORT_ESP_RST_BOOT_MS != 0)
    /* Before anything touches the bus, so the slave is always freshly booted */
    SdioResetSlaveHw();
#endif

    /* The sweep runs first: it is the only test that says where a wire actually
       lands, and a net the census rejects is exactly when that matters most */
#if (SDIO_PORT_CK_TOGGLE_MS != 0)
    SdioToggleCk();
#endif
#if (SDIO_PORT_PIN_DIAG != 0)
    /* No point clocking the bus when the host cannot even assert CMD */
    if (SdioPinDiag() != 0U) {
        return FAILURE;
    }
#endif

    if (SdioKernelClockConfig() != HAL_OK) {
        SDIO_LOGE(TAG, "SDMMC1 kernel clock config failed");
        return FAILURE;
    }

    kernel_clk = HAL_RCCEx_GetPeriphCLKFreq(RCC_PERIPHCLK_SDMMC1);
    if (kernel_clk == 0U) {
        SDIO_LOGE(TAG, "SDMMC1 kernel clock is 0");
        return FAILURE;
    }

    hsdio1.Instance = SDMMC1;
    hsdio1.Init.ClockEdge = SDMMC_CLOCK_EDGE_RISING;
    hsdio1.Init.ClockPowerSave = SDMMC_CLOCK_POWER_SAVE_DISABLE;
    /* Enumerate in 1-bit; SdioSetBusWidth4() widens the link afterwards */
    hsdio1.Init.BusWide = SDMMC_BUS_WIDE_1B;
    hsdio1.Init.HardwareFlowControl = SDMMC_HARDWARE_FLOW_CONTROL_DISABLE;
    /* SDMMC_CK = kernel_clk / (2 * ClockDiv); ClockDiv is 10 bits */
    hsdio1.Init.ClockDiv = kernel_clk / (2U * SDIO_PORT_CLOCK_HZ);
    if (hsdio1.Init.ClockDiv > 0x3FFU) {
        hsdio1.Init.ClockDiv = 0x3FFU;
    }

    SDIO_LOGI(TAG, "[Clock] kernel=%luHz, div=%lu, SDMMC_CK=%luHz",
              (unsigned long)kernel_clk, (unsigned long)hsdio1.Init.ClockDiv,
              (unsigned long)(hsdio1.Init.ClockDiv ? kernel_clk / (2U * hsdio1.Init.ClockDiv)
                                                   : kernel_clk));

    /* Runs the CMD0/CMD5/CMD3/CMD7 enumeration and sets the CCCR bus width.
       A failed attempt leaves State back at RESET, so re-calling it is a clean
       restart of the whole sequence. */
    /* Claim the identification step before the HAL can default it */
    hsdio1.SDIO_IdentifyCard = SdioIdentifyCardSlow;

    for (retry = 0U; retry < SDIO_INIT_RETRY_COUNT; retry++) {
        status = HAL_SDIO_Init(&hsdio1);
        if (status == HAL_OK) {
            break;
        }
        SdioResetSlaveIo();
        HAL_Delay(SDIO_INIT_RETRY_MS);
    }

    sdio_enum_retries = retry;
    sdio_enum_mark = (status == HAL_OK) ? SDIO_MARK_ENUM_OK : SDIO_MARK_ENUM_FAIL;

    if (status != HAL_OK) {
        /* SDIO_InitCard() returns HAL_ERROR without recording an ErrorCode, so
           re-probe CMD0/CMD5 here to say which half of the link is at fault. */
        SDIO_LOGE(TAG, "HAL_SDIO_Init failed after %lu attempts, err=0x%08lx",
                  (unsigned long)SDIO_INIT_RETRY_COUNT,
                  (unsigned long)HAL_SDIO_GetError(&hsdio1));
        SdioProbeSlave();
        return FAILURE;
    }

    if (retry > 0U) {
        SDIO_LOGI(TAG, "slave enumerated after %lu retries (%lu ms)",
                  (unsigned long)retry,
                  (unsigned long)(retry * SDIO_INIT_RETRY_MS));
    }

    /* Everything below is a CMD52 on the same link that loses the occasional
       frame during identification, and a single miss here used to fail the whole
       init even though enumeration had succeeded. Same answer as there: retry
       the command rather than the sequence. */
#if (SDIO_PORT_BUS_WIDTH == HAL_SDIO_4_WIRES_MODE)
    for (retry = 0U; retry < SDIO_IDENT_CMD_RETRY; retry++) {
        if (SdioSetBusWidth4() == SDIO_SUCCESS) {
            break;
        }
        HAL_Delay(2U);
    }

    if (retry >= SDIO_IDENT_CMD_RETRY) {
        SDIO_LOGE(TAG, "set 4-bit bus width failed");
        return FAILURE;
    }
#endif

    if (HAL_SDIO_RegisterIOFunctionCallback(&hsdio1, SDIO_PORT_FUNCTION,
                                            EspIoInterruptCallback) != HAL_OK) {
        return FAILURE;
    }

    for (retry = 0U; retry < SDIO_IDENT_CMD_RETRY; retry++) {
        if (HAL_SDIO_EnableIOFunction(&hsdio1, SDIO_PORT_FUNCTION) == HAL_OK) {
            break;
        }
        HAL_Delay(2U);
    }

    if (retry >= SDIO_IDENT_CMD_RETRY) {
        SDIO_LOGE(TAG, "enable IO function 1 failed");
        return FAILURE;
    }

    for (retry = 0U; retry < SDIO_IDENT_CMD_RETRY; retry++) {
        if (HAL_SDIO_SetBlockSize(&hsdio1, SDIO_PORT_FUNCTION,
                                  SDIO_PORT_BLOCK_SIZE) == HAL_OK) {
            break;
        }
        HAL_Delay(2U);
    }

    if (retry >= SDIO_IDENT_CMD_RETRY) {
        SDIO_LOGE(TAG, "set block size failed");
        return FAILURE;
    }

    for (retry = 0U; retry < SDIO_IDENT_CMD_RETRY; retry++) {
        if (HAL_SDIO_EnableIOFunctionInterrupt(&hsdio1, SDIO_PORT_FUNCTION) == HAL_OK) {
            break;
        }
        HAL_Delay(2U);
    }

    if (retry >= SDIO_IDENT_CMD_RETRY) {
        SDIO_LOGE(TAG, "enable IO function 1 interrupt failed");
        return FAILURE;
    }

    sdio_enum_mark = SDIO_MARK_DRIVER_OK;
    return SDIO_SUCCESS;
}

sdio_err_t sdio_driver_read_byte(uint32_t function, uint32_t reg, uint8_t *out_byte)
{
    HAL_SDIO_DirectCmd_TypeDef cmd52;

    cmd52.Reg_Addr = reg;
    cmd52.ReadAfterWrite = 0U;
    cmd52.IOFunctionNbr = function & 0x7U;

