khofesh/stm32-projects/nucleo-h533re/002_esp_at_sdio/Core/Src/at_sdio/platform/sdio_driver_port.c
    if (HAL_SDIO_ReadDirect(&hsdio1, &cmd52, out_byte) != HAL_OK) {
        SDIO_LOGE(TAG, "CMD52 read error, func %lu reg 0x%lx",
                  (unsigned long)function, (unsigned long)reg);
        return FAILURE;
    }
    return SDIO_SUCCESS;
}

sdio_err_t sdio_driver_write_byte(uint32_t function, uint32_t reg, uint8_t in_byte,
                                  uint8_t *out_byte)
{
    HAL_SDIO_DirectCmd_TypeDef cmd52;

    cmd52.Reg_Addr = reg;
    cmd52.ReadAfterWrite = 0U;
    cmd52.IOFunctionNbr = function & 0x7U;

    if (HAL_SDIO_WriteDirect(&hsdio1, &cmd52, in_byte) != HAL_OK) {
        SDIO_LOGE(TAG, "CMD52 write error, func %lu reg 0x%lx",
                  (unsigned long)function, (unsigned long)reg);
        return FAILURE;
    }

    /* HAL_SDIO_WriteDirect discards the read-after-write payload, so when the
       caller wants it back issue a plain CMD52 read instead. */
    if (out_byte != NULL) {
        return sdio_driver_read_byte(function, reg, out_byte);
    }
    return SDIO_SUCCESS;
}

static sdio_err_t SdioTransfer(uint32_t function, uint32_t addr, void *buffer,
                               uint32_t len, uint32_t block_mode, uint8_t is_write)
{
    HAL_SDIO_ExtendedCmd_TypeDef cmd53;
    HAL_StatusTypeDef status;

    if ((buffer == NULL) || (len == 0U)) {
        return ERR_INVALID_ARG;
    }
    if (((uintptr_t)buffer & 3U) != 0U) {
        SDIO_LOGE(TAG, "buffer must be 4-byte aligned");
        return ERR_INVALID_ARG;
    }
    if ((block_mode == HAL_SDIO_MODE_BYTE) && (len > SDIO_PORT_MAX_BYTE_XFER)) {
        SDIO_LOGE(TAG, "byte mode transfer too long: %lu", (unsigned long)len);
        return ERR_INVALID_ARG;
    }
    if ((block_mode == HAL_SDIO_MODE_BLOCK) && ((len % SDIO_PORT_BLOCK_SIZE) != 0U)) {
        SDIO_LOGE(TAG, "block mode length %lu not a multiple of %u",
                  (unsigned long)len, (unsigned int)SDIO_PORT_BLOCK_SIZE);
        return ERR_INVALID_ARG;
    }

    cmd53.Reg_Addr = addr;
    cmd53.OpCode = HAL_SDIO_OP_CODE_AUTO_INC;
    cmd53.Block_Mode = block_mode;
    cmd53.IOFunctionNbr = function & 0x7U;

    if (is_write != 0U) {
        status = HAL_SDIO_WriteExtended(&hsdio1, &cmd53, (uint8_t *)buffer, len, 1000U);
    } else {
        status = HAL_SDIO_ReadExtended(&hsdio1, &cmd53, (uint8_t *)buffer, len, 1000U);
    }

    if (status != HAL_OK) {
        uint32_t err = HAL_SDIO_GetError(&hsdio1);
        SDIO_LOGE(TAG, "CMD53 %s error, addr 0x%lx count %lu, err 0x%08lx%s%s%s%s%s",
                  (is_write != 0U) ? "write" : "read", (unsigned long)addr,
                  (unsigned long)len, (unsigned long)err,
                  ((err & HAL_SDIO_ERROR_DATA_CRC_FAIL) != 0U) ? " DATA_CRC_FAIL" : "",
                  ((err & HAL_SDIO_ERROR_DATA_TIMEOUT) != 0U) ? " DATA_TIMEOUT" : "",
                  ((err & HAL_SDIO_ERROR_TX_UNDERRUN) != 0U) ? " TX_UNDERRUN" : "",
                  ((err & HAL_SDIO_ERROR_RX_OVERRUN) != 0U) ? " RX_OVERRUN" : "",
                  ((err & HAL_SDIO_ERROR_TIMEOUT) != 0U) ? " TIMEOUT" : "");
        return FAILURE;
    }
    return SDIO_SUCCESS;
}

sdio_err_t sdio_driver_read_bytes(uint32_t function, uint32_t addr, void *buffer, uint32_t len)
{
    return SdioTransfer(function, addr, buffer, len, HAL_SDIO_MODE_BYTE, 0U);
}

sdio_err_t sdio_driver_write_bytes(uint32_t function, uint32_t addr, void *buffer, uint32_t len)
{
    return SdioTransfer(function, addr, buffer, len, HAL_SDIO_MODE_BYTE, 1U);
}

sdio_err_t sdio_driver_read_blocks(uint32_t function, uint32_t addr, void *buffer, uint32_t len)
{
    return SdioTransfer(function, addr, buffer, len, HAL_SDIO_MODE_BLOCK, 0U);
}

sdio_err_t sdio_driver_write_blocks(uint32_t function, uint32_t addr, void *buffer, uint32_t len)
{
    return SdioTransfer(function, addr, buffer, len, HAL_SDIO_MODE_BLOCK, 1U);
}

sdio_err_t sdio_driver_wait_int(uint32_t timeout)
{
    uint32_t start = HAL_GetTick();

    esp_int_flag = 0U;
    __HAL_SDIO_CLEAR_FLAG(&hsdio1, SDMMC_FLAG_SDIOIT);
    __HAL_SDIO_ENABLE_IT(&hsdio1, SDMMC_IT_SDIOIT);
    __SDMMC_OPERATION_ENABLE(hsdio1.Instance);

    while (esp_int_flag == 0U) {
        if ((HAL_GetTick() - start) > timeout) {
            __HAL_SDIO_DISABLE_IT(&hsdio1, SDMMC_IT_SDIOIT);
            return ERR_TIMEOUT;
        }
    }
    return SDIO_SUCCESS;
}
